To wrap up your understanding, we will discuss several problems and determine what your solutions that you will suggest to the stakeholders?

1.You have segmented your customers by using clustering algorithm and the results are stored in the labels column. What promotion strategy you’ll recommend to the marketing division?

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/fahmimnalfrzki/Dataset/main/Mall%20Customers.csv")

In [3]:
df

,Unnamed: 0,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Label
0,0,1,Male,19,15,39,0
1,1,2,Male,21,15,81,4
2,2,3,Female,20,16,6,0
3,3,4,Female,23,16,77,4
4,4,5,Female,31,17,40,0
...,...,...,...,...,...,...,...
195,195,196,Female,35,120,79,1
196,196,197,Female,45,126,28,2
197,197,198,Male,32,126,74,1
198,198,199,Male,32,137,18,2
199,199,200,Male,30,137,83,1

Promotion Strategy untuk Label 0:
1. Apa kualitas produknya? Kualitas produk rendah (kualitas KW, looks premium)
2. Berapa harganya? Harga Produk tinggi.
3. Channelnya lewat mana? E-commerce.
4. Discount: Harus gratis ongkir, diskon besar.
5. Karena umurnya tua (45): Harga tinggi, diskon besar.
6. Karena mayoritas perempuan (14 vs 9): Promonya lebih besar di Shopee.

Promotion Strategy untuk Label 1:
1. Apa kulitas produknya? Ada harga, ada kualitas.
2. Discount: Harus gratis ongkir, potongan credit card, voucher Min. Belanja, dapat cashback Koin.
3. Channel: E-commerce.
4. Status Toko: Star+ / Pro Merchant (agar dapat promo potongan CC dari Tokopedia/Shopee)
5. Garansi (perlu agar customer merasa aman, dan agar spending koinnya di Toko kita): 3 bulan (tapi pengakuan kita, ga mikir garansi, lebih mikirin kualitas)

Promotion Strategy untuk Label 2:
1. Saya pelit, saya akan beli barang yang sifatnya Limited (kesempatan untuk jual barang Limited dengan harga mahal).
2. Barang-barang primer.
3. Discount: Tanggal kembar (11.11), diskon besar.
4. Kualitas barang: harus bagus (karena label ini jarang belanja, sekali belanja dapat barang jelek, abis Toko lu)

Promotion Strategy untuk Label 3:
1. Barang-barang primer.
2. Discount: Harus (karena label ini pencari diskon)
3. Channel: Ecommerce.
4. Kualitas produk: biasa aja (karena bukan orang kaya, beli produk juga yang harganya miring jadi ekspektasi menengah).
5. Barang branded yang di-diskon. Kita labelin Barang Cacat Pabrik padahal KW.

Promotion Strategy untuk Label 4:
1. Metode pembayaran: Pay Later.
2. Channel: Toko di Akulaku.
3. Barang-barang branded, barang-barang trend (impulsive buying).
4. Channel Product Preview: TikTok.
5. Strategi Pay Later: Bunga 0%. "KURANG DARI 15 MENIT, PASTI DIACC".

```
Label	  0	  1	  2	  3	  4
Gender					
Female	14	21	18	46	13
Male	  9 	18	19	33	9

# Label 0
# Gender: Female 14, Male 9
# Age: 19 - 67, mean = 45
# Annual Income (k$s): 15 ribu - 39 ribu, mean = 26 ribu
# Spending Score (1-100): 3 - 40, mean = 20

# Label 1
# Gender: Female 21, Male 18
# Age: 27 - 40, mean = 32
# Annual Income (k$): 69 - 137, mean = 86
# Spending Score (1-100): 63-97, mean = 82

# Label 2
# Gender: Female 18, Male 19
# Age: 19 - 59, mean = 40
# Annual Income (k$): 70 - 137, mean = 87
# Spending Score (1-100): 1 - 40, mean = 18

# Label 3
# Gender: Female 46, Male 33
# Age: 18 - 70, mean = 43
# Annual Income (k$): 39 - 71, mean = 54
# Spending Score (1 - 100): 35 - 61, mean = 49

# Label 4 (si langganan pinjol)
# Gender: Female 13, Male 9
# Age: 18 - 35, mean = 25
# Annual Income (k$s): 15 - 39, mean = 25
# Spending Score (1-100): 61 - 99, mean = 79
```

In [4]:
# Age: 19 - 67, mean = 45
# Annual Income (k$s): 15 ribu - 39 ribu, mean = 26 ribu
# Spending Score: 3 - 40, mean = 20
df.loc[df['Label'] == 0,['Gender', 'Age', 'Annual Income (k$)', 'Spending Score (1-100)']].agg(['count','mean','min','max'])

/var/folders/w9/5lrd8m1x4f586v9ynn8xrryw0000gn/T/ipykernel_59788/429468513.py:4: FutureWarning: ['Gender'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.loc[df['Label'] == 0,['Gender', 'Age', 'Annual Income (k$)', 'Spending Score (1-100)']].agg(['count','mean','min','max'])

       Gender        Age  Annual Income (k$)  Spending Score (1-100)
count      23  23.000000           23.000000               23.000000
mean      NaN  45.217391           26.304348               20.913043
min    Female  19.000000           15.000000                3.000000
max      Male  67.000000           39.000000               40.000000

In [5]:
# Age: 27 - 40, mean = 32
# Annual Income (k$): 69 - 137, mean = 86
# Spending Score (1-100): 63-97, mean = 82
df.loc[df['Label'] == 1,['Age', 'Annual Income (k$)', 'Spending Score (1-100)']].agg(['count','mean','min','max'])

             Age  Annual Income (k$)  Spending Score (1-100)
count  39.000000           39.000000               39.000000
mean   32.692308           86.538462               82.128205
min    27.000000           69.000000               63.000000
max    40.000000          137.000000               97.000000

In [6]:
df.loc[df['Label'] == 1,'Gender'].mode()

0    Female
Name: Gender, dtype: object

In [7]:
# Age: 19 - 59, mean = 40
# Annual Income (k$): 70 - 137, mean = 87
# Spending Score (1-100): 1 - 40, mean = 18
df.loc[df['Label'] == 2,['Age', 'Annual Income (k$)', 'Spending Score (1-100)']].agg(['count','mean','min','max'])

             Age  Annual Income (k$)  Spending Score (1-100)
count  37.000000           37.000000               37.000000
mean   40.324324           87.432432               18.189189
min    19.000000           70.000000                1.000000
max    59.000000          137.000000               40.000000

In [8]:
# Age: 18 - 70, mean = 43
# Annual Income (k$): 39 - 71, mean = 54
# Spending Score (1 - 100): 35 - 61, mean = 49
df.loc[df['Label'] == 3,['Age', 'Annual Income (k$)', 'Spending Score (1-100)']].agg(['count','mean','min','max'])

             Age  Annual Income (k$)  Spending Score (1-100)
count  79.000000           79.000000               79.000000
mean   43.126582           54.822785               49.835443
min    18.000000           39.000000               35.000000
max    70.000000           71.000000               61.000000

In [9]:
# Age: 18 - 35, mean = 25
# Annual Income (k$s): 15 - 39, mean = 25
# Spending Score (1-100): 61 - 99, mean = 79
df.loc[df['Label'] == 4,['Age', 'Annual Income (k$)', 'Spending Score (1-100)']].agg(['count','mean','min','max'])

             Age  Annual Income (k$)  Spending Score (1-100)
count  22.000000           22.000000               22.000000
mean   25.272727           25.727273               79.363636
min    18.000000           15.000000               61.000000
max    35.000000           39.000000               99.000000

In [10]:
pd.crosstab(df.loc[:,'Gender'],df.loc[:,'Label'])

Label    0   1   2   3   4
Gender
Female  14  21  18  46  13
Male     9  18  19  33   9

# Easier way

In [22]:
# force pandas to suppress the scientific notation
pd.options.display.float_format = "{:,.2f}".format

df.groupby('Label')[['Age', 'Annual Income (k$)', 'Spending Score (1-100)']].agg(['mean','min','max'])

        Age         Annual Income (k$)          Spending Score (1-100)
       mean min max               mean min  max                   mean min max
Label
0     45.22  19  67              26.30  15   39                  20.91   3  40
1     32.69  27  40              86.54  69  137                  82.13  63  97
2     40.32  19  59              87.43  70  137                  18.19   1  40
3     43.13  18  70              54.82  39   71                  49.84  35  61
4     25.27  18  35              25.73  15   39                  79.36  61  99